822A - I'm bored with life Codeforces Problem Solution & Logic
http://codeforces.com/problemset/problem/822/A

খুবই মজার একটা ট্রিকি সমস্যা, তোমায় ২ টা সংখ্যা দেয়া থাকবে। তোমায়, সেই ২ টা সংখ্যার ফ্যাক্টোরিয়াল এর গ সা গু  বের করতে হবে। ধরো, ২টা সংখ্যা আছে -- 4 & 3,
তাহলে ---                                 
         4! = 4 . 3 . 2 . 1

         3!=  3 . 2 . 1  

এখন আমাদের কিন্তু, গ সা গু বের করার জন্য কোনো, ফাংশন ক্রিয়েট করতেই হবে না, চলো দেখে নেই - রহস্যা'টা আসলে কি ????
                    
                       4 . 3 . 2 . 1
4! /  3!  =  ................................... = 4   । কি , বুঝলে ??? বড়ো সংখ্যাটির ফ্যাক্টোরিয়াল সবসময় ছোট
                        3 . 2 . 1 

সংখ্যার ফ্যাক্টোরিয়াল দিয়ে নিঃশেষে বিভাজ্য হবে । তাহলে , যে সংখ্যা দুইটি -- দেয় থাকবে , আমাদের উত্তর হবে , ছোট সংখ্যা'টির  ফ্যাক্টোরিয়াল  । । তাও যদি  বুঝতে কষ্ট হয় , তাহলে একটু নিজে নিজে ট্রাই করে দেখো বিভিন্ন সংখ্যা নিয়ে আস্তে আস্তে বিষয়টি ক্লিয়ার হয়ে যাবে , আশা করি ---------------------
চলো কোড দেখে নেই - এইবার ---------------

#include<bits/stdc++.h>
using namespace std;
int main() {
    
  int a, b;
  scanf ( "%d%d", &a, &b );
  int ans = 1;
  for ( int j = 1; j <= min( a, b ); j++ )
        {
            ans *= j;
        }
    printf ( "%d\n", ans);
 }
