Lightoj 1331 Ajent J 
Problem Link: 
Source Link: http://sajibtalukder2k16.blogspot.com/2019/01/blog-post.html

হৃতিক রোশানের <3 ধুম ২ সিনেমাতে ডায়মন্ড চুরির  দৃশ্যটি অনেকেই দেখেছো । Lightoj এর 1331 নাম্বার প্রবলেমটি একটি ডায়মন্ড চুরি নিয়ে। 
এখানে একজন এজেন্ট 'J ' আছে, যে কিনা মিউজিয়াম ডায়মন্ডটি চুরি করতে চায় । যদিও এই চুরিটা করা এতোটা সহজ নয়। কারণ,এখানে ৩টি বৃত্তাকার লেজার স্ক্যানার আছে, যেগুলো অনবরত ঘুরছে।স্ক্যানার ৩টি এমনভাবে বসানো যাতে বৃত্তাকার স্ক্যানার ৩টি চিত্রের মতো প্রতিটিই বাহ্যিকভাবে এক অপরকে স্পর্শ করে। আর ডায়মন্ড আছে সেই ৩টি বৃত্তাকার স্ক্যানার এর মাঝখানে রাখা হয়েছে।এখন আমাদেরকে সেই আবদ্ধ স্থানটি (রঙিন এরিয়া) পরিমাপ করতে হবে।যেখানে আমাকে ৩টি বৃত্তাকার স্ক্যানার এর ব্যাসার্ধ দেয়া আছে R1,R2,R3 ।
তো আমরা কিভাবে সমস্যাটি সমাধান করবো  ?

এই সমাধানের জন্য আমাদেরকে একটুখানি জ্যামিতির জ্ঞান থাকলেই হবে ।

প্রথমত ,আমরা যদি প্রতিটি বৃত্তের কেন্দ্রকে অপর দুটি বৃত্তের কেন্দ্রের সাথে যোগ করি ,তবে আমরা একটি ত্রিভুজ পাবো নিচের চিত্রের মতো । এখন শুধু ত্রিভুজের ক্ষেত্রফল থেকে , ত্রিভুজের মধ্যে অবস্থিত বৃত্তের অংশগুলো বাদ দিয়ে দেই তাহলেই আমরা ডায়মন্ডের  এরিয়া পেয়ে যাবো ।
এখন ,
    R1 ও R2 বৃত্তের মধ্যকার বাহুকে ধরি , a
    R2 ও R3 বৃত্তের মধ্যকার বাহুকে ধরি , b
    R1 ও R3 বৃত্তের মধ্যকার বাহুকে ধরি , c
         
           তাহলে,
                    a=r1+r2
                    b=r2+r3  
                    c=r3+r1
  এখন তিনটি বাহুর দৈর্ঘ্য দেয়া থাকলে আমরা 
ত্রিভুজটির ক্ষেত্রফল বের করতে পারি ,এর 
জন্য প্রথমেই আমাদের  পরিসীমা বের করতে 
হবে ।
       
            পরিসীমা P=a+b+c

তাহলে ত্রিভুজটির ক্ষেত্রফল হবে,
                       area=sqrt(s*(s-a)*(s-b)*(s-c))

যেখানে s হচ্ছে পরিসীমার অর্ধেক । 

             s= p/2

এখন আমরা ত্রিভুজটির ক্ষেত্রফল জানি ।

মাধ্যমিক শ্রেণির জ্যামিতি থেকে আমরা বৃত্তকলার
 ক্ষেত্রফল সম্পর্কে জানি । এখানে বৃত্তকলার 
ক্ষেত্রফল দিয়ে আমরা ত্রিভুজের অন্তর্গত বৃত্তের 
অংশের ক্ষেত্রফল জানতে পারি , সে জন্য আমাদের সুত্র হলো,-------> {  বৃত্তকলার ক্ষেত্রফল = (১/২)* ব্যাসার্ধ * ব্যাসার্ধ * বৃত্তকলার অন্তর্ভুক্ত কোণ  }
  
এখন আমাদের প্রতিটি বৃত্তের জন্য বৃত্তকলার 
ক্ষেত্রফল বের করতে হলে ,আমাদের বাহুগুলির 
অন্তর্ভুক্ত কোণগুলি জানতে হবে । আর সেজন্য 
আমরা জানি,               
      cos(C) = a2 + b2 − c22ab
      cos(A) = b2 + c2 − a22bc
      cos(B) = c2 + a2 − b22ca
তাহলে ,
            area1=.5*r1*r1*acos((c*c+a*a-b*b)/(2*c*a)) 
এখানে
 acos((c*c+a*a-b*b)/(2*c*a))
দ্বারা cos-1((c*c+a*a-b*b)/(2*c*a))কে বুঝানো হয়েছে। 

 area2=.5*r2*r2*acos((b*b+a*a-c*c)/(2*a*b))

 area3=.5*r3*r3*acos((c*c+b*b-a*a)/(2*b*c))

এখন , ত্রিভুজের ক্ষেত্রফল থেকে বৃত্তকলার 
ক্ষেত্রফলগুলো বিয়োগ করলেই আমাদের 
ডায়মন্ডের এরিয়াটুকু পেয়ে যাবো।
code: 
#include <iostream>
#include <cmath>
const double pi  = std::atan(1)*4;

// #define pi acos(-1)
// const double pi = 2 * acos (0.0);

int main() {
        int t, cs = 0;
        scanf("%d", &t);
        while (t--) {
                double r1, r2, r3, a, b, c, s, area, area1, area2, area3;
                scanf("%lf %lf %lf", &r1, &r2, &r3);
                a = r1 + r2, b = r2 + r3, c = r3 + r1;
                s = (a+b+c)/2;
                area = sqrt(s*(s-a)*(s-b)*(s-c));
                area1 = 0.5*r1*r1*acos((c*c+a*a-b*b)/(2*c*a));
                area2 = 0.5*r2*r2*acos((b*b+a*a-c*c)/(2*b*a));
                area3 = 0.5*r3*r3*acos((c*c+b*b-a*a)/(2*c*b));

                //cout<<acos(pi/180*(c*c+a*a-b*b)/(2*c*a))<<" "<<acos(pi/180*(b*b+a*a-c*c)/(2*a*b))<<" "<<acos(pi/180*(c*c+b*b-a*a)/(2*b*c))<<endl;

                printf("Case %d: %lf\n", ++cs, area - (area1+area2+area3));
        }
        return 0;
}
